package com.example.invoice.ui.helper.db

import android.content.Context
import android.database.sqlite.SQLiteDatabase
import android.database.sqlite.SQLiteOpenHelper

class DbHelper(context: Context) : SQLiteOpenHelper(context,MyDbNameClass.DATABASE_NAME,
    null,MyDbNameClass.DATABASE_VERSION) {

    override fun onCreate(db: SQLiteDatabase?) {

        db?.execSQL(MyDbNameClass.SQL_CREATE_CLIENT)
        db?.execSQL(MyDbNameClass.SQL_CREATE_PRODUCT)
        db?.execSQL(MyDbNameClass.SQL_CREATE_ORDERS)
        db?.execSQL(MyDbNameClass.SQL_CREATE_ORDER_PRODUCTS)

        db?.execSQL("Insert into " + MyDbNameClass.Client.TABLE_NAME_CLIENT +
                " (" + MyDbNameClass.Client.COLUMN_NAME_CLIENT_NAME + "," + MyDbNameClass.Client.COLUMN_NAME_CLIENT_HOST + "," +
                MyDbNameClass.Client.COLUMN_NAME_CLIENT_INN + "," + MyDbNameClass.Client.COLUMN_NAME_CLIENT_ADDRESS + ") " +
                "VALUES ('Исфайрам','Рохида эже ','12010197800690','Уч-Коргон')," +
                "('Мадина','Акрам ака','22402197300028','Уч-Коргон')," +
                "('Давронжон','Даврон ака','21612198600671','Уч-Коргон')," +
                "('Умид','Хаким ака ','22208196300071','Уч-Коргон')," +
                "('Мафтуна','Азим ака ','22510196500186','Уч-Коргон')," +
                "('Ясмина ','Гулшодахон','10909198101024','Уч-Коргон')," +
                "('Камил- Ата','Хайрулложон ','21711138300788','Уч-Коргон')," +
                "('777',' ','11710198300215','Уч-Коргон')," +
                "('Сардор','Бахтиер ака','11501196201142','Уч-Коргон')," +
                "('Семья ','Комилжон','20406199800724','Уч-Коргон')," +
                "('Ак-Ниет ','Дадахон ака ','12706196300669','Уч-Коргон')," +
                "('Шукрона ','Саноат эже ','12504195800288','Уч-Коргон')," +
                "('Зарифжон','Зариф ака ','22701197800475','Уч-Коргон')," +
                "('Зухридинжон','Ойбек','20602197300472','Уч-Коргон')," +
                "('Мурод Хожи ','Ёкубжон','1091219600350','Уч-Коргон')," +
                "('Осие','Акмалжон ака ','21809198601804','Уч-Коргон')," +
                "('Тулкин','Тулкин ака ','10708197500480','Уч-Коргон')," +
                "('Дилнур','Махмуд ака','20202198200797','Уч-Коргон')," +
                "('Халал','Гани ака','10608197500818','Уч-Коргон')," +
                "('Бинафша','Отабек','211101198701123','Уч-Коргон')," +
                "('Моя Семья','Одилжон ','12703195100066','Уч-Коргон')," +
                "('МММ','Одилжон ака','22706198700517','Уч-Коргон')," +
                "('Меражидин','Меражидин ака ','21401197901323','Тоо-Моюн')," +
                "('Махбурат','Махбурат эже','10312197700027','Тоо-Моюн')," +
                "('Изатбек','Изатбек','10710197600776','Тоо-Моюн')," +
                "('Минимаркет','Элмира эже','11012198000525','Тоо-Моюн')," +
                "('Алия ','Амирбек ака','20304197801312','Тоо-Моюн')," +
                "('Береке','Асель эже ','11809198801228','Тоо-Моюн')," +
                "('Аиша','Бусабира эже ','1030719800630','Тоо-Моюн')," +
                "('Эрлан','Эрлан ака','10703196600476','Тоо-Моюн')," +
                "('Сарагул',' ','12001197700489','Тоо-Моюн')," +
                "('Асел','Асел эже ','10907199100773','Тоо-Моюн')," +
                "('Байэл','Махабат эже ','11901196200471','Тоо-Моюн')," +
                "('Ырыскы','Канталат эже ','12502197800549','Тоо-Моюн')," +
                "('Умут ','Дурусбек','22201198400452','Кызыл-Кыя')," +
                "('Айдар','Хошим ака','23006197200814','Кызыл-Кыя')," +
                "('Анхор','Алишер ака','20705197800662','Кызыл-Кыя')," +
                "('Кирпичный ',' ','12312197300522','Кызыл-Кыя')," +
                "('Нурсултан',' ','12605198900818','Кызыл-Кыя')," +
                "('Нур',' ','11505197300695','Кызыл-Кыя')," +
                "('Халли Маркет','Гулшаной ','12108198300565','Кызыл-Кыя')," +
                "('Корзинка ','Бахром ака','20605199401532','Кызыл-Кыя')," +
                "('Перекросток',' ','12604196300581','Кызыл-Кыя')," +
                "('Южный ','Бахром','23005200000050','Кызыл-Кыя')," +
                "('Диер',' ','12101197901161','Кызыл-Кыя')," +
                "('Амина ',' ','20101196802491','Кызыл-Кыя')," +
                "('Азия ',' ','11210196310043','Кызыл-Кыя')"
        )
        db?.execSQL("Insert into " + MyDbNameClass.Product.TABLE_NAME_PRODUCT +
                " (" + MyDbNameClass.Product.COLUMN_NAME_PRODUCT_NAME + "," + MyDbNameClass.Product.COLUMN_NAME_PRODUCT_PRICE + ") " +
                "VALUES ('салями халал в/у', 390.0)," +
                "('сервелат халал в/у   ', 390.0)," +
                "('канская халал в/у', 390.0)," +
                "('телячья халал в/у', 390.0)," +
                "('сырная халал в/у', 390.0)," +
                "('южная халал в/у', 350.0)," +
                "('халал вакум в/у', 390.0)," +
                "('кабаноси', 405.0)," +
                "('кабаноси в/у', 415.0)," +
                "('княжеская', 395.0)," +
                "('княжеская в/у', 395.0)," +
                "('краковская В/у', 360.0)," +
                "('эстонская в/у', 315.0)," +
                "('салями иператор', 345.0)," +
                "('ветчина в копчен', 410.0)," +
                "('докторская халал', 325.0)," +
                "('сардельки халал', 325.0)," +
                "('сосиски детс хал.', 325.0)," +
                "('сосиски детс в/у', 325.0)," +
                "('особая нар сетка', 345.0)," +
                "('особая в/у', 335.0)," +
                "('Столичная', 340.0)," +
                "('докторская экано', 285.0)," +
                "('доктор 1 сорт.', 200.0)," +
                "('сосиски 1 сорт', 200.0)," +
                "('салями 1 сорт', 300.0)," +
                "('сервелат 1 сорт', 285.0)," +
                "('сервелат чесноч', 275.0)," +
                "('мусульм 1 сорт', 240.0)," +
                "('мусульм фиброс', 275.0)," +
                "('сервелат прем.', 420.0)," +
                "('салями премиум', 420.0)," +
                "(' окорочка копчен', 255.0)," +
                "('сыр голандский', 570.0)," +
                "('курдюк резанный', 605.0)," +
                "('куринная грудка', 455.0)," +
                "('сос зам майрам', 232.68)," +
                "('сос зам любитель', 232.68)," +
                "('сос зам традицион', 199.44)," +
                "('сос кури охлажд', 310.0)," +
                "('сос любит охлажд', 325.0)," +
                "('сос молч охлажд', 325.0)," +
                "('сос сливо охлажд', 325.0)," +
                "('сос трад охлажд', 325.0)," +
                "('сос фирмен охлаж', 325.0)"
        )
    }

    override fun onUpgrade(db: SQLiteDatabase?, oldVersion: Int, newVersion: Int) {

        db?.execSQL(MyDbNameClass.SQL_DELETE_CLIENT)
        db?.execSQL(MyDbNameClass.SQL_DELETE_PRODUCT)
        db?.execSQL(MyDbNameClass.SQL_DELETE_ORDERS)
        db?.execSQL(MyDbNameClass.SQL_DELETE_ORDER_PRODUCTS)

        onCreate(db)
    }
}